src/cf/Catalogs/НастройкиТранспортаСообщенийОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>НастройкиТранспортаСообщенийОбмена</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Корреспондент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПланыОбменаБСД</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторТранспорта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Настройки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Настройка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonModules/ТранспортСообщенийОбменаВызовСервера/Ext/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

Процедура УстановитьПарольСинхронизацииДанных(Знач Корреспондент, Знач ДанныеАутентификации) Экспорт
	
	ТранспортСообщенийОбмена.УстановитьПарольСинхронизацииДанных(Корреспондент, ДанныеАутентификации);
	
КонецПроцедуры

Функция ПолноеИмяФормыПервойНастройки(Знач ИдентификаторТранспорта) Экспорт
	
	Возврат ТранспортСообщенийОбмена.ПолноеИмяФормыПервойНастройки(ИдентификаторТранспорта)
	
КонецФункции

Функция ПолноеИмяФормыНастройки(Знач ИдентификаторТранспорта) Экспорт
	
	Возврат ТранспортСообщенийОбмена.ПолноеИмяФормыНастройки(ИдентификаторТранспорта)
	
КонецФункции

Процедура СохранитьНастройкиТранспорта(Знач Корреспондент, Знач ИдентификаторТранспорта, Знач НастройкиТранспорта) Экспорт
	
	ТранспортСообщенийОбмена.СохранитьНастройкиТранспорта(Корреспондент, ИдентификаторТранспорта, НастройкиТранспорта);
	
КонецПроцедуры

Функция НастройкиТранспорта(Знач Корреспондент, Знач ИдентификаторТранспорта) Экспорт
	
	Возврат Справочники.НастройкиТранспортаСообщенийОбмена.НастройкиТранспорта(
		Корреспондент, ИдентификаторТранспорта);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТранспортПоУмолчанию(Знач Корреспондент) Экспорт

	Возврат Справочники.НастройкиТранспортаСообщенийОбмена.ТранспортПоУмолчанию(Корреспондент);
	
КонецФункции

Функция НазначитьТранспортПоУмолчанию(Знач Корреспондент, Знач ИдентификаторТранспорта) Экспорт
	
	Справочники.НастройкиТранспортаСообщенийОбмена.НазначитьТранспортПоУмолчанию(
		Корреспондент, ИдентификаторТранспорта);
	
КонецФункции

Функция ТребуетсяАутентификация(Знач ПараметрыАутентификации, ИмяФормы) Экспорт
	
	Возврат ТранспортСообщенийОбмена.ТребуетсяАутентификация(ПараметрыАутентификации, ИмяФормы);
	
КонецФункции

#КонецОбласти
